{"post_id": "1jyqfpr", "platform": "reddit", "author": "overpopyoulater", "content": "Peter Dutton says he wants house prices to 'steadily increase' to protect home owners", "created_at": "2025-04-14T04:25:35+00:00", "tags": ["Australia"]}
{"post_id": "1j1c8mn", "platform": "reddit", "author": "Expensive-Horse5538", "content": "“Immigration is the problem with housing” says guy who had 26 properties", "created_at": "2025-03-01T22:57:29+00:00", "tags": ["Australia"]}
{"post_id": "1fjfvh5", "platform": "reddit", "author": "thewritingchair", "content": "Japan’s public transport and housing is so good it makes ours feel like a hate crime\n\nWent to Japan a few months back and upon return when people say how was it, all I want to talk about is infrastructure.\n\nA public transport system that actually functions! \n\nYou would not believe it but it’s possible to get off a train and the connecting bus is just there. Like, on time. Where it’s meant to be at the time it’s meant to be there. \n\nGoing somewhere? Jump on the train. Use the bus. \n\nOh man, the high speed trains too. Zip from Tokyo to Osaka in comfort and style and all I’m thinking about is why this doesn’t exist between Melbourne and Geelong/Ballarat/Bendigo. Why doesn’t it exist between Sydney and Wollongong and down the coast? \n\nI went to see a cool art show (TeamLabs, check it out if you’re there) and found these cool apartment buildings, a shopping centre, and a train stop all within actual walking distance. \n\nLike you could come out of your apartment, cross fifty metres of an open beautiful green space that had people using it, and go into a shopping area with supermarkets, bakeries and all sorts of things. \n\nSince I’ve come back it’s just so blindingly obvious that the infrastructure of our cities and towns is beyond fucked and wrong. \nNo integration of transport, living, working, and shops. \n\nIt’s just nuts that we have these shopping centres and there’s not great apartments right next to them… and a bloody connecting train line with frequent trains. \n\nI walked around a Tokyo suburb and it was all mixed use. A business next to housing next to a food place next to more housing next to business next to apartments next to another food place. \n\nWhen I came back the first Skybus didn’t even stop as it was running late, the second was full and then finally got on the third, which was 90% full when it arrived. The longest wait I had in an entire month was on that f*cking bus trying to get back to Melbourne. Going through roadworks. No dedicated airport train is a disgrace.  \n\nWe need to immediately import some Tokyo city planners over here and put them in charge of the public transport system, housing and infrastructure.\n\nEDIT: I can see population density coming up as a reason. Melbourne has 5.3 million people. Sydney has 5.18 million.\n\nYes Tokyo, Osaka etc have much higher populations but mate, 5+ million people is nothing to sneeze at.", "created_at": "2024-09-18T00:34:43+00:00", "tags": ["Australia"]}
{"post_id": "1h25xza", "platform": "reddit", "author": "stupid_mistake__101", "content": "“Back in my day we were happy without social media” says guy whose ‘day’ had affordable housing and free uni", "created_at": "2024-11-28T21:16:01+00:00", "tags": ["Australia"]}
{"post_id": "1ij34pi", "platform": "reddit", "author": "K1ngCr1mson", "content": "Buying a house in 1990\n\nBuying a house at 19 years old - then vs now...", "created_at": "2025-02-06T13:57:58+00:00", "tags": ["Australia"]}
{"post_id": "140xwet", "platform": "reddit", "author": "stumcm", "content": "Housing Crisis 1983 vs 2023", "created_at": "2023-06-05T01:36:24+00:00", "tags": ["Australia"]}
{"post_id": "1jfy6vk", "platform": "reddit", "author": "overpopyoulater", "content": "‘Vandals in the White House’ no longer reliable allies of Australia, former defence force chief says", "created_at": "2025-03-20T20:06:06+00:00", "tags": ["Australia"]}
{"post_id": "1jm6l0j", "platform": "reddit", "author": "overpopyoulater", "content": "Central Coast man earns house deposit by collecting 450,000 cans and bottles", "created_at": "2025-03-28T21:47:17+00:00", "tags": ["Australia"]}
{"post_id": "1dqg7ke", "platform": "reddit", "author": "DewArtist", "content": "Crazy Guy Drives Into House In Perth Suburbs", "created_at": "2024-06-28T10:12:21+00:00", "tags": ["Australia"]}
{"post_id": "14pc36l", "platform": "reddit", "author": "Ok_loop", "content": "Why are these houses so freaking cold ?!?!\n\nSorry I just need to vent. \n\nEx-pat here, lived in Maine, USA my whole life. Been here for 5 years and I cannot believe the absolute disgrace of how poorly insulated these houses are in NSW. It’s absolutely freezing inside people’s homes and they heat them with a single freaking wall-mounted AC Unit. \n\nI’ve lived in places where it’s been negative temps for weeks and yet inside it’s warm and cosy. \n\nI’ve never been colder than I have in this county in the winter it’s fucking miserable inside. Australians just have some kind of collective form of amnesia that weather even exists. They don’t build for it, dress for it and are happy to pay INSANE energy costs to mitigate it. \n\nUgh I’m so over the indoor temperature bullshit that is this country. \n\nOk rant over.", "created_at": "2023-07-03T07:27:26+00:00", "tags": ["Australia"]}
{"post_id": "149ltsa", "platform": "reddit", "author": "stumcm", "content": "Housing Crisis 1983 vs 2023, Part 2: The Cause", "created_at": "2023-06-14T22:57:00+00:00", "tags": ["Australia"]}
{"post_id": "1ihw2q8", "platform": "reddit", "author": "TheSaltyTrash", "content": "Preferential voting in the house of representatives\n\nGot taken down because of the title i think… \nSo we’re posting it again because this is really important!\nUnfortunately a lot of Aussies don’t understand our voting system so hopefully this can help some people!\n\nVoting third party is not a wasted vote! By voting third party you are giving them funding, potentially seats in parliament and maybe in the future allowing them to win the election (it would take multiple elections but it isn’t impossible)", "created_at": "2025-02-04T23:37:56+00:00", "tags": ["Australia"]}
{"post_id": "102zadi", "platform": "reddit", "author": "ObnoxiousOldBastard", "content": "Canada has banned foreign buyers to address housing affordability. Should Australia follow?", "created_at": "2023-01-04T09:34:48+00:00", "tags": ["Australia"]}
{"post_id": "18871h4", "platform": "reddit", "author": "Faiiven", "content": "Just came past this.. interesting house", "created_at": "2023-12-01T08:34:52+00:00", "tags": ["Australia"]}
{"post_id": "1972fh2", "platform": "reddit", "author": "homiedizzle", "content": "How is House still \"closing down\"?\n\nIs this not some kind of sales law about this stupid tactic? They have been \"closing down\" for literally as long as I can remember.", "created_at": "2024-01-15T06:51:55+00:00", "tags": ["Australia"]}
{"post_id": "trvvo8", "platform": "reddit", "author": "Mikes005", "content": "Scott Morrison says renters should buy a house if they want rent relief", "created_at": "2022-03-30T02:13:24+00:00", "tags": ["Australia"]}
{"post_id": "1grv4hr", "platform": "reddit", "author": "FallingUpwardz", "content": "We just bought our first house. Ray White gave us a keyring and 2 champagne glasses to “celebrate” (no wine?) lmao\n\nWhat a wank lol, one of those things that would have felt better to just, not get? ", "created_at": "2024-11-15T12:21:15+00:00", "tags": ["Australia"]}
{"post_id": "1bzjdnf", "platform": "reddit", "author": "sgarn", "content": "‘Free house’: Renter advocate and social media star Jordan van den Berg encourages struggling Aussies to become squatters", "created_at": "2024-04-09T04:30:39+00:00", "tags": ["Australia"]}
{"post_id": "1fvp6b6", "platform": "reddit", "author": "2littleducks", "content": "A man charged over the brazen firebombing of a controversial YouTuber’s house has been granted bail after a judge heard he had cut ties with an outlaw motorcycle group.", "created_at": "2024-10-04T02:42:49+00:00", "tags": ["Australia"]}
{"post_id": "qldh4k", "platform": "reddit", "author": "Rage_Dophin", "content": "Cleo smith found alive and well in locked house", "created_at": "2021-11-02T20:31:46+00:00", "tags": ["Australia"]}
{"post_id": "szblce", "platform": "reddit", "author": "the-Chaser", "content": "We decided to drop by Scott Morrison's house today to deliver a much needed package", "created_at": "2022-02-23T07:35:26+00:00", "tags": ["Australia"]}
{"post_id": "1dckfpt", "platform": "reddit", "author": "madaroni7", "content": "And people be whinging about house prices in Australia...", "created_at": "2024-06-10T12:36:20+00:00", "tags": ["Australia"]}
{"post_id": "1g4ueiz", "platform": "reddit", "author": "malcolm58", "content": "Australia’s birth rates lowest since 2006; house prices blamed", "created_at": "2024-10-16T08:18:52+00:00", "tags": ["Australia"]}
{"post_id": "epacul", "platform": "reddit", "author": "Drakey02", "content": "My physics teacher defended her house from bushfires by herself, and then waited out the fire in her pool using a scuba tank.", "created_at": "2020-01-15T23:20:44+00:00", "tags": ["Australia"]}
